; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l7_p7_c7_g7_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 medicine)
	(at person1 loc5)
	(at person2 loc5)
	(at person3 loc1)
	(at person4 loc7)
	(at person5 loc7)
	(at person6 loc5)
	(at person7 loc7)
	(person-needs person1 food)
	(person-needs person2 food)
	(person-needs person3 food)
	(person-needs person5 food)
	(person-needs person5 medicine)
	(person-needs person6 food)
	(person-needs person7 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person3 food)
	(person-has person5 food)
	(person-has person5 medicine)
	(person-has person6 food)
	(person-has person7 food)
	))
)

; plan
1. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 1 of 8
2. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 1 of 8
3. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 0 of 8
4. (deliver-arm2 drone1 person5 crate7 medicine loc7)
   deleted: (arm2-load drone1 crate7) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 1 of 8
5. (move-drone drone1 loc7 loc1)
   deleted: (at drone1 loc7)
   added: (at drone1 loc1)
   goals met: 1 of 8
6. (deliver-arm1 drone1 person3 crate6 food loc1)
   deleted: (arm1-load drone1 crate6) (person-needs person3 food)
   added: (arm1-free drone1) (person-has person3 food)
   goals met: 2 of 8
7. (move-drone drone1 loc1 loc5)
   deleted: (at drone1 loc1)
   added: (at drone1 loc5)
   goals met: 2 of 8
8. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 3 of 8
9. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 3 of 8
10. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 2 of 8
11. (deliver-arm2 drone1 person1 crate5 food loc5)
   deleted: (arm2-load drone1 crate5) (person-needs person1 food)
   added: (arm2-free drone1) (person-has person1 food)
   goals met: 3 of 8
12. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 4 of 8
13. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 4 of 8
14. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 3 of 8
15. (deliver-arm2 drone1 person2 crate4 food loc5)
   deleted: (arm2-load drone1 crate4) (person-needs person2 food)
   added: (arm2-free drone1) (person-has person2 food)
   goals met: 4 of 8
16. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 5 of 8
17. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 5 of 8
18. (move-drone drone1 depot loc5)
   deleted: (at drone1 depot)
   added: (at drone1 loc5)
   goals met: 4 of 8
19. (deliver-arm2 drone1 person6 crate3 food loc5)
   deleted: (arm2-load drone1 crate3) (person-needs person6 food)
   added: (arm2-free drone1) (person-has person6 food)
   goals met: 5 of 8
20. (move-drone drone1 loc5 loc7)
   deleted: (at drone1 loc5)
   added: (at drone1 loc7)
   goals met: 5 of 8
21. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 6 of 8
22. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 6 of 8
23. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 5 of 8
24. (deliver-arm2 drone1 person5 crate2 food loc7)
   deleted: (arm2-load drone1 crate2) (person-needs person5 food)
   added: (arm2-free drone1) (person-has person5 food)
   goals met: 6 of 8
25. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 7 of 8
26. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 7 of 8
27. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 6 of 8
28. (deliver-arm2 drone1 person7 crate1 food loc7)
   deleted: (arm2-load drone1 crate1) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 7 of 8
29. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 8 of 8
